---
kind: method
id: M:Autodesk.Revit.DB.ElementSetIterator.#ctor
source: html/86034a17-ab33-37b5-7c50-ce3ae508e6fa.htm
---
# Autodesk.Revit.DB.ElementSetIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ElementSetIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.